
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаЗагрузки = ТекущаяДата();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьКурсыВалют(Команда)
	
	ПолучитьКурсыВалютНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсыВалют(Команда)
	
	ЗагрузитьКурсыВалютНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьКурсыВалютНаСервере()
	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалютНаСервере()
	
	Адрес = Объект.Валюта.Код + Формат(Объект.ДатаЗагрузки, "ДФ=/yyyy/MM/dd");
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(Адрес);
	ПараметрыЗадания.Добавить(Объект.Валюта);
	ПараметрыЗадания.Добавить(Объект.ДатаЗагрузки);
	
	ФоновыеЗадания.Выполнить("ОбщийМодульСервер.ЗагрузитьКурсыВалют", ПараметрыЗадания, Новый УникальныйИдентификатор, "Загрузка курсов валют");
	
КонецПроцедуры

#КонецОбласти
