
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Курс = ОбщийМодульСервер.ПолучитьКурсВалюты(Валюта, Дата);
	
	// регистр ОплатыПоЗаказам Приход
	Движения.ОплатыПоЗаказам.Записывать = Истина;
	Движение = Движения.ОплатыПоЗаказам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Заказ = Ссылка;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаДокумента * Курс;
	Движение.СуммаВал = СуммаДокумента;
	
КонецПроцедуры
