
Процедура ЗагрузкаКурсовВалют() Экспорт
	
	ДатаЗагрузки = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Валюты.Код КАК Код,
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Адрес = ВыборкаДетальныеЗаписи.Код + Формат(ДатаЗагрузки, "ДФ=/yyyy/MM/dd");
		ОбщийМодульСервер.ЗагрузитьКурсыВалют(Адрес, ВыборкаДетальныеЗаписи.Валюта, ДатаЗагрузки);
		
	КонецЦикла;
	
КонецПроцедуры
