
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоЭлементов = 10;
	ВариантСортировки = 1;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьАналогСтрРазделить(Команда)
	
	Результат = "";
	
	РезультатАналогСтрРазделить = ОбщийМодульКлиентСервер.АналогСтрРазделить(ИсходнаяСтрока, Разделитель);
	
	Для каждого ЭлементМассива Из РезультатАналогСтрРазделить Цикл
		
		Результат = Результат + ЭлементМассива + Символы.ПС;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАналогСтрСоединить(Команда)
	
	ИсходныйМассив = ИсходныйСписок.ВыгрузитьЗначения();
	
	Результат = ОбщийМодульКлиентСервер.АналогСтрСоединить(ИсходныйМассив, Разделитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМассивСлучайнымиЗначениями(Команда)
	
	НеСотрированныйМассив.Очистить();
	СортированныйМассив.Очистить();
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Пока НеСотрированныйМассив.Количество() < КоличествоЭлементов Цикл
		
		НеСотрированныйМассив.Добавить(ГСЧ.СлучайноеЧисло(0,999));
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьМассив(Команда)
	
	СортированныйМассив.ЗагрузитьЗначения(ОбщийМодульКлиентСервер.СортироватьМассив(НеСотрированныйМассив.ВыгрузитьЗначения(), ВариантСортировки));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСтруктурыМассивыВСтроку(Команда)
	
	ВходнойПрарметр = Новый Структура;
	
	МассивКлючаА = Новый Массив;
	МассивКлючаА.Добавить("100");
	МассивКлючаА.Добавить("200");
	МассивКлючаА.Добавить("100");
	ВходнойПрарметр.Вставить("КлючА", МассивКлючаА);
	
	СтруктураКлючаА = Новый Структура;
	СтруктураКлючаА.Вставить("СтруктураКлючаА1", 366);
	МассивКлючаА1 = Новый Массив;
	МассивКлючаА1.Добавить("5");
	МассивКлючаА1.Добавить("7");
	СтруктураКлючаА.Вставить("СтруктураКлючаА2", МассивКлючаА1);
	ВходнойПрарметр.Вставить("КлючБ", СтруктураКлючаА);
	
	
	МассивКлючаВ = Новый Массив;
	МассивКлючаВ.Добавить("5");
	МассивКлючаВ.Добавить("7");
	МассивКлючаВ.Добавить("100");
	СтруктураКлючаВ = Новый Структура;
	СтруктураКлючаВ.Вставить("Ключ1", 13);
	СтруктураКлючаВ.Вставить("СтруктураКлючаА2", МассивКлючаА1);
	ВходнойПрарметр.Вставить("КлючВ", СтруктураКлючаВ);
	
	ВходнойПрарметр.Вставить("КлючГ", 0);
	
	Результат = ОбщийМодульКлиентСервер.ОбработатьСтруктурыИМассивы(ВходнойПрарметр);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
